// 1.Посмотрите на схему, сопоставьте номер с его обозначением

// 1-Номера (индексы) элементов массива.
// 2-Название массива.
// 3-Элементы массива.


// 2.Выберите описание, которое характеризует Сортировку пузырьком (Bubble sorting):- Последовательно сравниваются значения соседних элементов и меняются местами элементы, если предыдущий больше последующего. Таким образом элементы с большим значением оказываются в конце списка, а с меньшим в начале.

// 3.Алгоритмизация – это…
//процесс разработки алгоритма для решения какой-либо задачи

// 4.Выберите то, что НЕ является характеристикой алгоритма:
//G-Независимый от языка

// 5.Какого алгоритма НЕ существует?
//Жадный алгоритм

// 6.Посмотрите на картинку и выберите определение для каждого элемента блок-схемы:
// 1-начало (конец) алгоритм
// 2-операционный блок
// 3-цикл с параметром
// 4-логический (условный) блок
// 5-блок ввода/вывода

